INSERT INTO departments (name, creation_date, parent_id) VALUES
  ('Разработка и внедрение', '2018-07-05', NULL),
  ('Проекты', '2018-07-08', NULL),
  ('Финансы и администрирование', '2018-07-08', NULL);
--------------------------------------------------------------------
INSERT INTO departments ( NAME, creation_date, parent_id) VALUES
('Разработка', '2018-07-08', 1),
('Поддержка', '2018-07-10', 1),
('Управление базами данных', '2018-08-12', 1),
('Обеспечение качества', '2018-08-12', 1),
('Офис отдельных программ', '2018-08-12', 2),
('Офис управления проектами', '2018-08-12', 2),
('Внутренний консалтинг', '2018-08-12', 2),
('Финансы', '2018-08-12', 3),
('Контракты', '2018-09-19', 3),
('Административные функции', '2018-10-12', 3),
('Управление персоналом', '2018-09-12', 3);
--------------------------------------------------------------------
INSERT INTO employees (last_name, first_name, patronymic, gender, date_of_birth, phone_number, mail, employment_date, date_of_dismissal, position, salary, is_chief, department_id) VALUES
('Чунихин', 'Владислав', 'Андреевич', 'муж', '1995-10-21', '+8462232526', 'chunikhin@gmail.com', '2018-12-26', NULL, 'Программист', 80000, TRUE, 1),
('Петров', 'Владислав', 'Андреевич', 'муж', '1993-10-21', '+8462233326', 'petrov@gmail.com', '2018-12-11', NULL, 'Программист', 45000, FALSE, 1),
('Иванова', 'Елизавета', 'Андреевна', 'жен', '1998-10-21', '+8462132526', 'ivanova@gmail.com', '2018-12-17', NULL, 'Программист', 45000, FALSE, 1),
('Насенков', 'Петр', 'Андрееич', 'муж', '1992-10-21', '+8462132526', 'nasenkov@yandex.ru', '2018-10-11', NULL, 'Уборщик', 15000, FALSE, 2),
('Иванова', 'Елизавета', 'Андреевна', 'жен', '1992-10-21', '+8462132336', 'ivanova@gmail.com', '2018-12-11', NULL, 'Программист', 150000, TRUE, 2),
('Хромов', 'Максим', 'Константинович', 'муж', '1994-10-21', '+8462132216', 'ivanova@gmail.com', '2018-12-26', NULL, 'Менеджер', 35000, FALSE, 2),
('Путин', 'Максим', 'Константинович', 'муж', '1992-10-21', '+8462132526', 'khromov@gmail.com', '2018-12-11', NULL, 'Менеджер', 35000, FALSE, 3),
('Денисов', 'Дмитрий', 'Константинович', 'муж', '1992-10-21', '+8462132526', 'ivanova@gmail.com', '2018-12-11', NULL, 'Программист', 85000, TRUE, 3),
('Хромов', 'Максим', 'Константинович', 'муж', '1992-10-21', '+8462132526', 'ivanova@gmail.com', '2018-10-11', NULL, 'Менеджер', 75000, FALSE, 3),
('Хромов', 'Максим', 'Константинович', 'муж', '1996-10-21', '+8462152589', 'ivanova@gmail.com', '2018-12-17', NULL, 'Программист', 35000, FALSE, 4),
('Бузин', 'Алексей', 'Константинович', 'муж', '1992-10-21', '+8468932526', 'ivanova@gmail.com', '2018-10-17', NULL, 'Программист', 75000, TRUE, 4),
('Абдалова', 'Татьяна', 'Сергеевна', 'жен', '1991-10-21', '+8462138926', 'ivanova@gmail.com', '2018-12-17', NULL, 'Менеджер', 35000, FALSE, 4);
--------------------------------------------------------------------
UPDATE departments
SET
  chief_id = 1
WHERE id = 1;
UPDATE departments
SET
  chief_id = 5
WHERE id = 2;
UPDATE departments
SET
  chief_id = 8
WHERE id = 3;
UPDATE departments
SET
  chief_id = 11
WHERE id = 4;
--------------------------------------------------------------------